
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииД_СогласованнаяСкидка(Элемент)
// Володин А.А. 
// Задача 1 ДЗ Командная работа (EDT) 
// 25 сентября 2024 г.
	ЗадатьВопросОРасчете();
// Конец вставки от 25 сентября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РасчетСкидкиКоманда()
// Володин А.А. 
// Задача 1 ДЗ Командная работа (EDT) 
// 25 сентября 2024 г.
	
	//Выполним условие задачи: Если таблица пустая, вопрос задаваться не должен.
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
		
		Возврат;
		
	Иначе
		
		ЗадатьВопросОРасчете();
		
	КонецЕсли;
// Конец вставки от 8 августа 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	
// Володин А.А. 
// Задача 1 ДЗ Командная работа (EDT) 
// 25 сентября 2024 г.	
	
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	СкидкаВШапке =  1 - Объект.Д_СогласованнаяСкидка/100;
	СуммарнаяСкидка = (КоэффициентСкидки + СкидкаВШапке) - 1;
	
	//Проверим чтобы скидка не была больше 100%
	Если СуммарнаяСкидка < 0 Тогда
		
		СуммарнаяСкидка = 0;
		Сообщить(СтрШаблон("По позиции %1 сумма введенных скидок превышает 100%%!", ТекущиеДанные.Номенклатура), СтатусСообщения.Внимание); 
				
	КонецЕсли;
		
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * СуммарнаяСкидка;	
	
// Конец вставки от 25 сентября 2024 г.	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Асинх Процедура ЗадатьВопросОРасчете()
// Володин А.А. 
// Задача 1 ДЗ Командная работа (EDT) 
// 25 сентября 2024 г.
	Оповещение = Новый ОписаниеОповещения("ПослеОтвета", ЭтотОбъект);	
	
	ПоказатьВопрос(Оповещение, "Пересчитать скидку?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Пересчитать скидку?");    	
// Конец вставки от 25 сентября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтвета(Результат, Параметры) Экспорт
// Володин А.А. 
// Задача 1 ДЗ Командная работа (EDT) 
// 25 сентября 2024 г.
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РассчитатьСкидку();
		
	КонецЕсли;	
// Конец вставки от 25 сентября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидку()
// Володин А.А. 
// Задача Задача 1 ДЗ Командная работа (EDT) 
// 25 сентября 2024 г.
	Для Каждого Строка Из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла;
// Конец вставки от 25 сентября 2024 г.
КонецПроцедуры

#КонецОбласти
